#ifndef MK_NETWORKING 
#define MK_NETWORKING

#include <sys/msg.h>
#include <sys/ipc.h>
#include <sys/time.h>
#include <time.h>

#define WIFI_DEV            "wlan0"
#define ETH_DEV             "eth0"
#define CMD_AP              "hostapd"
#define CONF_AP 		    "/etc/hostapd.conf"
#define CONF_AP_TMP	    	"/etc/hostapd_tmp.conf"
#define CMD_DHCPD           "udhcpd"
#define CONF_DHCPD          "/etc/udhcpd.conf"
#define CMD_STA             "wpa_supplicant"
#define CONF_STA		    "/etc/wpa_supplicant.conf"
#define CMD_DHCPC           "udhcpc"
#define CONF_DHCPC		    "/etc/udhcpc.script"

/*****************************************************************************
 函 数 名  : detect_connect_routes
 功能描述  : 设备检测连接路由线程
********************************** *******************************************/
extern void *detect_connect_routes(void *arg);

/*****************************************************************************
 函 数 名  : mk_connect_network
 功能描述  : 设备联网控制线程
*****************************************************************************/
extern void *mk_connect_network(void *arg);

/*****************************************************************************
 函 数 名  : mk_wlan0_start
 功能描述  : 开启设备无线连接
*****************************************************************************/
extern void mk_wlan0_start();

/*****************************************************************************
 函 数 名  : mk_wlan0_stop
 功能描述  : 关闭设备无线连接
*****************************************************************************/
extern void mk_wlan0_stop();

/*****************************************************************************
 函 数 名  : mk_wifiAP_start
 功能描述  : 开启设备无线连接
*****************************************************************************/
extern void mk_wifiAP_start();

/*****************************************************************************
 函 数 名  : mk_wifiAP_stop
 功能描述  : 关闭设备无线连接
*****************************************************************************/
extern void mk_wifiAP_stop();

/*****************************************************************************
 函 数 名  : mk_eth0_start
 功能描述  : 开启设备有线连接
*****************************************************************************/
extern void mk_eth0_start();

/*****************************************************************************
 函 数 名  : mk_eth0_stop
 功能描述  : 关闭设备有线连接
*****************************************************************************/
extern void mk_eth0_stop();

/*****************************************************************************
 函 数 名  : network_status_proc
 功能描述  : 网络状态线程
*****************************************************************************/

extern void *network_status_proc(void *arg);

/*****************************************************************************
 * 函数名：	mk_check_network_mode
 * 功能描述：	获取当前网络类型
 ****************************************************************************/
extern int mk_check_network_mode(void);

#endif
